app/controllers/classified_controller.rb

SELECT * FROM "classifieds" WHERE ("classifieds"."id" = 1)
---
  def show
    @classified = Classified.find(params[:id])

INSERT INTO "classifieds" ("updated_at", "title", "price", "description", "location", "email", "created_at") VALUES('2009-05-07 12:24:45', 'Mai', 200.0, 'Japan', 'Nagoya', 'mai@mai.com', '2009-05-07 12:24:45')
---
  def create
    @classified = Classified.new(params[:classified])
    if @classified.save

SELECT * FROM "classifieds" WHERE ("classifieds"."id" = 1)
---
  def edit
    @classified = Classified.find(params[:id])

SELECT * FROM "classifieds" WHERE ("classifieds"."id" = 1)
UPDATE "classifieds" SET "description" = 'CF programmer yeah', "updated_at" = '2009-05-11 04:30:06' WHERE "id" = 6
---
  def update
    @classified = Classified.find(params[:id])
   if @classified.update_attributes(params[:classified])

DELETE FROM "classifieds" WHERE "id" = 2
SELECT * FROM "classifieds" WHERE ("classifieds"."id" = 2)
---
  def delete
    Classified.find(params[:id]).destroy